<a href="https://colab.research.google.com/github/ngriggs/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/Explanatory_Visualizations_Code_Challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

# Data Frame to practice .loc[] techniques on
df = pd.DataFrame({'index':[1, 2, 3, 4, 5],
                   'name_1':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_2':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_3':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_4':['entry1', 'entry2', 'entry3', 'entry4', 'entry5'],
                   'name_5':['entry1', 'entry2', 'entry3', 'entry4', 'entry5']})

# Set Index
df.set_index('index', inplace=True)

print(df)
### Select by a Single Label
#1 Select and print the '1' Row

#2 Select and print Row 1 Label with Column 1 Label to get entry1

### Select Multiple Rows Using LISTS
#1 Select and print Row Labels 1, 2

#2 Select and print Row Labels 1, 3, 5

# Now Rows WITH desired Columns
#3 Select and print Row Labels 1, 2, 3 with Column Labels 'name_1', 'name_2', 'name_3'

#4 Select and print Row Labels 1, 3, 4, 5 with Column Labels 'name_1', 'name_3', 'name_4', 'name_5'

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2  entry2
3      entry3  entry3  entry3  entry3  entry3
4      entry4  entry4  entry4  entry4  entry4
5      entry5  entry5  entry5  entry5  entry5

### Select by a Single Label

In [0]:
#1 Select and print the '1' Row

df.loc[1]

name_1    entry1
name_2    entry1
name_3    entry1
name_4    entry1
name_5    entry1
Name: 1, dtype: object

In [0]:
#2 Select and print Row 1 Label with Column 1 Label to get entry1
df.loc[1,'name_1']

'entry1'

### Select Multiple Rows Using LISTS

In [0]:
#1 Select and print Row Labels 1, 2

df.loc[1:2]

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
2      entry2  entry2  entry2  entry2  entry2

In [0]:
#2 Select and print Row Labels 1, 3, 5

df.loc[[1,3,5]]

       name_1  name_2  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1  entry1
3      entry3  entry3  entry3  entry3  entry3
5      entry5  entry5  entry5  entry5  entry5

# Now Rows WITH desired Columns

In [0]:
#3 Select and print Row Labels 1, 2, 3 with Column Labels 'name_1', 'name_2', 'name_3'

df.loc[[1,3,5], ['name_1', 'name_2', 'name_3']]

       name_1  name_2  name_3
index
1      entry1  entry1  entry1
3      entry3  entry3  entry3
5      entry5  entry5  entry5

In [0]:
#4 Select and print Row Labels 1, 3, 4, 5 with Column Labels 'name_1', 'name_3', 'name_4', 'name_5'

df.loc[[1,3,4,5],['name_1', 'name_3', 'name_4', 'name_5']]

       name_1  name_3  name_4  name_5
index
1      entry1  entry1  entry1  entry1
3      entry3  entry3  entry3  entry3
4      entry4  entry4  entry4  entry4
5      entry5  entry5  entry5  entry5